import pandas as pd

df = pd.DataFrame({
    'Наименования':["Пылесос", "Телевизор", "Ноутбук", "Телевизор", "Ноутбук", "Пылесос", "Ноутбук"],
    'Фирма':["Bosch", "LG", "Samsung", "LG", "Bosch", "LG", "Samsung"],
    'Количество':[3, 5, 12, 7, 1, 41, 23],
    'Цена':["120000₽", "140000₽", "540000", "140000₽", "470000₽", "90000₽", "560000"],
    'Общая сумма':["360000₽", "700000₽", "6480000₽", "980000₽", "470000₽", "3690000₽", "12880000₽"]},
    index = [1, 2, 3, 4, 5, 6, 7]  
    )
df.index.name = 'День'

print(df.columns)
print(df.rolling)
print(df['Наименования'])
print(df['Фирма'], df['Количество'], df['Цена'])
