import pandas as pd

df = pd.DataFrame({
    'Наименования':["Пылесос", "Телевизор", "Ноутбук", "Телевизор", "Ноутбук", "Пылесос", "Ноутбук"],
    'Фирма':["Bosch", "LG", "Samsung", "LG", "Bosch", "LG", "Samsung"],
    'Количество':[3, 5, 12, 7, 1, 41, 23],
    'Цена':[1200.00, 1400.00, 5400.00, 1400.00, 4700.00, 900.00, 5600.00],
    'Общая сумма':[3600.00, 7000.00, 64800.00, 9800.00, 4700.00, 36900.00, 128800.00]},
    index = [1, 2, 3, 4, 5, 6, 7]  
    )
df.index.name = 'День'

print(df.columns)
print(df.rolling)
print(df['Наименования'])
print(df['Фирма'], df['Количество'], df['Цена'])
