'''
1.	Сделайте разбор URL-адреса 5-ти интернет-адресов и определите статус запроса.
2.	Выведите информацию пользователю об элементах URL-адресов. 
3.	Напишите программу, которая информирует пользователя об отсутствии элементов при разборе URL-адреса. 
4.	Выведите информацию пользователю о статусе кода запроса адресов.
5.	Выполните сбор интернет-адресов с помощью двух функций и получите информацию в байтах, затем конвертируйте в строку.
'''

import requests


urls = {
    '': None,
    '': None,
    '': None,
    '': None,
    '': None
}
