import numpy as np
import pandas as pd

#Создайте табличную структуру данных.

array_name = np.array(["Грепфрут","Абрикос","Морковь","Нектарин","Баклажан","Грейпфрут","Лук","Персик","Морковь"])
array_month = np.array(["Январь"]*10)
array_day = np.array()
print(array_day)
# Выведите название столбцов и данные таблицы отдельно.
# Выведите значениястолбца Наименование.
# Затем выведите последовательно Месяц, День и Склад.
