import pandas as pd

df = pd.DataFrame({
    'Наименования':["Пылесос", "Телевизор", "Ноутбук", "Телевизор", "Ноутбук", "Пылесос", "Ноутбук", "Ноутбук", "Пылесос", "Телевизор", "Телевизор", "Пылесос", "Ноутбук", "Телевизор", "Пылесос"],
    'Фирма':["Bosch", "LG", "Samsung", "LG", "Bosch", "LG", "Samsung", "LG", "Bosch", "Samsung", "Bosch", "LG", "LG", "Samsung", "Bosch"],
    'Количество':[3, 5, 12, 7, 1, 41, 23, 4, 27, 7, 9, 16, 22, 14, 1],
    'Цена':[1200.00, 1400.00, 5400.00, 1400.00, 4700.00, 900.00, 5600.00, 6000.00, 1200.00, 1700.00, 2100.00, 900.00, 6000.00, 1700.00, 1200.00]},
    index = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15]  
    )
df.index.name = 'День'

workers = df.loc[df.Цена > 2000.00]

sell = [1, 4, 10, 5, 1, 34, 20, 2, 15, 4 ,5, 15, 18, 4, 0]
df['Продажи'] = sell
df['Общая сумма'] = df['Количество'] * df['Цена']

print(df.sort_values('Цена'))
print(df)
print(df.loc[df.Фирма == "LG"])
print(df.loc[10])
print(df.loc[(df.Фирма == "Samsung") & (df.Количество > 10) & (df.Количество < 20)])
